Revit 2026 API

# VertexStreamPositionNormal Properties

---

The VertexStreamPositionNormal type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from VertexStream) |

#### Reference

VertexStreamPositionNormal Class

Autodesk.Revit.DB.DirectContext3D Namespace